       IDENTIFICATION DIVISION.
       PROGRAM-ID. LITCONT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  A   PIC X(50) VALUE "ABCDEFGHIJKLMNOPQRSTUVWXYZXXXXXXXXXXXXXX
      -    "MORE".
       01  B   PIC X(50) VALUE "HE SAID XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX"
      -    ""HI"" TO ME".
       PROCEDURE DIVISION.
       MAIN.
           DISPLAY "[" A "]".
           DISPLAY "[" B "]".
           STOP RUN.
