       01  proof-rec.
           05  tst-fld-1        pic 9(5).
           05  fil              pic x(3) value '---'.
           05  tst-fld-2        pic x(4) value 'abcd'.
