//REST    JOB (001),'TAPE RESTORE',CLASS=A,MSGLEVEL=(1,1),MSGCLASS=A
//JOBLIB  DD  DSN=SYS1.LINKLIB,DISP=SHR
//STEP01   EXEC PGM=IEFBR14
//SYSPRINT DD  SYSOUT=*
//DSN2DEL  DD  DSN=S32.VREC,DISP=(MOD,DELETE,DELETE),
//             UNIT=3380,VOL=SER=SVD002
//STEP02   EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=A
//SYSIN    DD  DUMMY
//SYSUT1   DD  DSN=S32.VREC,UNIT=TAPE,
//             VOL=(PRIVATE,RETAIN,SER=240001),LABEL=(1,SL),
//             DCB=(RECFM=V,LRECL=40,BLKSIZE=4096),
//             DISP=OLD
//SYSUT2   DD  DSN=S32.VREC,UNIT=3380,
//             VOL=SER=SVD002,DISP=(NEW,CATLG),
//             DCB=(RECFM=V,LRECL=40,DSORG=PS,BLKSIZE=23440),
//             SPACE=(TRK,(1,0))
