identification division.
program-id. extmfse.
*> -warn-extensions under -dialect=mf: BP-D3 and BP-D4.
procedure division.
p1.
    display "a" stop run display "b".
p2.
    display "c" exit.
