       identification division.
       program-id. altered.
       procedure division.
       p1.
           alter p2 to proceed to p3.
       p2.
           go to p3.
       p3.
           stop run.
