identification division.
program-id. al85.
*> ANY LENGTH is COBOL 2002.
data division.
linkage section.
01 l pic x any length.
procedure division.
    goback.
