identification division.
program-id. p.
data division.
working-storage section.
01 big pic 9(18).
01 frac pic v9(18).
procedure division.
    add big to frac
    stop run.
