identification division.
program-id. constant85.
*> The constant entry is COBOL 2002.
data division.
working-storage section.
01 k constant as 42.
procedure division.
    stop run.
