       identification division.
       program-id. nocopy.
       data division.
       working-storage section.
       copy nothing-here.
       procedure division.
           stop run.
