identification division.
program-id. p.
data division.
working-storage section.
copy cpfx replacing leading ==pfx== by ==ws==.
procedure division.
    stop run.
