identification division.
program-id. p.
data division.
working-storage section.
copy cpfx replacing ==, ;== by ==x==.
procedure division.
    stop run.
