      $IF X DEFINED
      * Only $SET of Micro Focus's directive lines is implemented.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DSETIF.
       PROCEDURE DIVISION.
           STOP RUN.
