       identification division.
       program-id. edval.
       data division.
       working-storage section.
       01  e  pic z(4)9.99 value 12.5.
       procedure division.
           stop run.
