identification division.
program-id. p.
data division.
working-storage section.
01 ix usage index.
  88 first-one value 1.
procedure division.
    continue
    stop run.
