identification division.
program-id. p.
data division.
working-storage section.
01 ix usage index sync.
procedure division.
    continue
    stop run.
