identification division.
program-id. mv.
data division.
working-storage section.
01 n pic 9(4).
procedure division.
    move space to n
    stop run.
