identification division.
program-id. p.
data division.
working-storage section.
01 i pic 9(10)xxxxxxxxxxxxxxxxxxxxxxxxxxx.
procedure division.
    stop run.
