identification division.
program-id. p.
data division.
working-storage section.
01 x pic x.
procedure division.
    display x replace ==a== by ==b==.
    stop run.
