identification division.
program-id. p.
data division.
working-storage section.
replace ==a== by ==b==.
replace also ==c== by ==d==.
procedure division.
    stop run.
