identification division.
program-id. repo.
environment division.
configuration section.
repository.
    function all intrinsic.
procedure division.
    stop run.
