identification division.
program-id. p.
data division.
working-storage section.
01 w pic x(4).
linkage section.
01 a pic x(4).
01 r pic x(4).

procedure division returning r.
    goback.
