       identification division.
       program-id. rounded.
       data division.
       working-storage section.
       01  a  pic s9(5)v99 value 1.
       procedure division.
           add 1.005 to a rounded.
           stop run.
