identification division.
program-id. p.
data division.
working-storage section.
01 t1.
   05 a pic x(3) occurs 5 indexed by i1.
procedure division.
    set i1 to 0
    stop run.
