identification division.
program-id. p.
data division.
working-storage section.
01 p usage pointer.
  88 nothing value null.
procedure division.
    continue
    stop run.
