identification division.
program-id. el.
data division.
working-storage section.
01 bb pic 1(4).
procedure division.
    move b"" to bb
    stop run.
