identification division.
program-id. p.
data division.
working-storage section.
01 w pic x(4).
linkage section.
01 a pic x(4).
01 b pic 9(4).

procedure division using by value optional b.
    continue
    goback.
