identification division.
program-id. mv.
data division.
working-storage section.
01 n pic 9(4).
procedure division.
    move high-values to n
    stop run.
