identification division.
program-id. p.
data division.
working-storage section.
01 g group-usage national.
 05 h usage display.
  10 a pic n.
procedure division.
    stop run.
