identification division.
program-id. bitx.
*> USAGE BIT is for boolean pictures (2023 13.18.66).
data division.
working-storage section.
01  b pic x(4) usage bit.
procedure division.

    stop run.
