identification division.
program-id. gubit.
*> GROUP-USAGE BIT is the BOOLEAN module, not here yet.
data division.
working-storage section.
01  g group-usage bit.
    05 a pic x.
procedure division.
    stop run.
