identification division.
program-id. p.
*> ARITHMETIC IS STANDARD was COBOL 2002's, obsolete in 2014, removed in 2023.
options.
    arithmetic is standard.
procedure division.
    stop run.
end program p.
