identification division.
program-id. turnf.
*> >>TURN for EC-I-O conditions of one file is not implemented yet.
>>TURN EC-I-O infile CHECKING ON
procedure division.
    stop run.
