identification division.
program-id. p.
data division.
working-storage section.
01 t typedef strong.
 05 a pic n(2).
01 g type t group-usage national.
procedure division.
    stop run.
