identification division.
program-id. p.
data division.
working-storage section.
01 g group-usage bit.
 05 h group-usage national.
  10 a pic n.
procedure division.
    stop run.
