identification division.
program-id. mv.
data division.
working-storage section.
01 e pic zz9.
procedure division.
    move all "12" to e
    stop run.
