identification division.
program-id. p.
data division.
working-storage section.
01 g usage display.
 05 b pic n(3).
procedure division.
    stop run.
