identification division.
program-id. p.
data division.
working-storage section.
01 g.
 05 p usage pointer.
procedure division.
    continue
    stop run.
