identification division.
program-id. p.
data division.
working-storage section.
01 a pic 9.
  88 c value 1 usage display.
procedure division.
    continue
    stop run.
