       identification division.
       program-id. toolong.
       data division.
       working-storage section.
       77  a   pic x(3) value 'abcd'.
       procedure division.
           stop run.
