       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVREMU.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 Q1 PIC 9 VALUE 0.
       01 R1 PIC S9 VALUE 0.
       01 Q2 PIC 99 VALUE 0.
       01 R2 PIC S99 VALUE 0.
       01 Q3 PIC 9V9 VALUE 0.
       01 R3 PIC S9V99 VALUE 0.
       PROCEDURE DIVISION.
       P0.
           DIVIDE -7 BY 2 GIVING Q1 REMAINDER R1
               ON SIZE ERROR DISPLAY '1 SIZE ERROR'.
           DISPLAY '1 Q=' Q1 ' R=' R1.
           DIVIDE -95 BY 7 GIVING Q2 REMAINDER R2
               ON SIZE ERROR DISPLAY '2 SIZE ERROR'.
           DISPLAY '2 Q=' Q2 ' R=' R2.
           DIVIDE -7.39 BY 3 GIVING Q3 REMAINDER R3
               ON SIZE ERROR DISPLAY '3 SIZE ERROR'.
           DISPLAY '3 Q=' Q3 ' R=' R3.
           STOP RUN.
