       IDENTIFICATION DIVISION.
       PROGRAM-ID. NEGCMP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 N00 PIC S9(4)V9(3) VALUE 9884.108.
       PROCEDURE DIVISION.
       P0.
           IF N00 NOT LESS THAN -316940 DISPLAY '1 T'
               ELSE DISPLAY '1 F'.
           IF N00 GREATER THAN -316940 DISPLAY '2 T'
               ELSE DISPLAY '2 F'.
           IF N00 LESS THAN -316940 DISPLAY '3 T'
               ELSE DISPLAY '3 F'.
           STOP RUN.
